outputs/aws/loadbalancer/haproxy/10000/ab_metrics5.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Caddy
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   8.752 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2690000 bytes
HTML transferred:       240000 bytes
Requests per second:    1142.57 [#/sec] (mean)
Time per request:       8.752 [ms] (mean)
Time per request:       0.875 [ms] (mean, across all concurrent requests)
Transfer rate:          300.15 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       5
Processing:     1    9   3.2      8      34
Waiting:        1    8   3.2      8      34
Total:          1    9   3.2      8      34

Percentage of the requests served within a certain time (ms)
  50%      8
  66%     10
  75%     10
  80%     11
  90%     13
  95%     14
  98%     16
  99%     18
 100%     34 (longest request)