outputs/aws/loadbalancer/haproxy/10000/ab_metrics6.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Caddy
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      10
Time taken for tests:   9.780 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2690000 bytes
HTML transferred:       240000 bytes
Requests per second:    1022.53 [#/sec] (mean)
Time per request:       9.780 [ms] (mean)
Time per request:       0.978 [ms] (mean, across all concurrent requests)
Transfer rate:          268.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0      28
Processing:     1   10   6.0      9     131
Waiting:        0    9   5.9      8     131
Total:          1   10   6.1      9     131

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     12
  90%     14
  95%     17
  98%     27
  99%     38
 100%    131 (longest request)